{"format": "layers-model", "generatedBy": "keras v2.2.5", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.2.5", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"output_layers": [["emotion_preds", 0, 0]], "name": "model_2", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_1"}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1_pad", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "conv1_pad", "padding": [[0, 1], [0, 1]]}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "name": "conv1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "name": "conv1", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "filters": 32, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "valid", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "conv1_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "name": "conv1_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv1_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "name": "conv_dw_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "name": "conv_dw_1", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "name": "conv_dw_1_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_1_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "name": "conv_dw_1_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_1_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "name": "conv_pw_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_1", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "name": "conv_pw_1_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_1_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "name": "conv_pw_1_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_1_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "name": "conv_pad_2", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "conv_pad_2", "padding": [[0, 1], [0, 1]]}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "name": "conv_dw_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [2, 2], "name": "conv_dw_2", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "valid", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "name": "conv_dw_2_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_2_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "name": "conv_dw_2_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_2_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "name": "conv_pw_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_2", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 128, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "name": "conv_pw_2_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_2_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "name": "conv_pw_2_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_2_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "name": "conv_dw_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "name": "conv_dw_3", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "name": "conv_dw_3_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_3_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "name": "conv_dw_3_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_3_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "name": "conv_pw_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_3", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 128, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "name": "conv_pw_3_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_3_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "name": "conv_pw_3_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_3_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "name": "conv_pad_4", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "conv_pad_4", "padding": [[0, 1], [0, 1]]}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "name": "conv_dw_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [2, 2], "name": "conv_dw_4", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "valid", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "name": "conv_dw_4_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_4_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "name": "conv_dw_4_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_4_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "name": "conv_pw_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_4", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 256, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "name": "conv_pw_4_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_4_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "name": "conv_pw_4_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_4_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "name": "conv_dw_5", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "name": "conv_dw_5", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "name": "conv_dw_5_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_5_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "name": "conv_dw_5_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_5_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "name": "conv_pw_5", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_5", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 256, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "name": "conv_pw_5_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_5_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "name": "conv_pw_5_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_5_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "name": "conv_pad_6", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "conv_pad_6", "padding": [[0, 1], [0, 1]]}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "name": "conv_dw_6", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [2, 2], "name": "conv_dw_6", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "valid", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "name": "conv_dw_6_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_6_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "name": "conv_dw_6_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_6_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "name": "conv_pw_6", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_6", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 512, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "name": "conv_pw_6_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_6_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "name": "conv_pw_6_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_6_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "name": "conv_dw_7", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "name": "conv_dw_7", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "name": "conv_dw_7_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_7_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "name": "conv_dw_7_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_7_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "name": "conv_pw_7", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_7", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 512, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "name": "conv_pw_7_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_7_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "name": "conv_pw_7_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_7_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "name": "conv_dw_8", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "name": "conv_dw_8", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "name": "conv_dw_8_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_8_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "name": "conv_dw_8_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_8_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "name": "conv_pw_8", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_8", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 512, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "name": "conv_pw_8_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_8_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "name": "conv_pw_8_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_8_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "name": "conv_dw_9", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "name": "conv_dw_9", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "name": "conv_dw_9_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_9_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "name": "conv_dw_9_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_9_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "name": "conv_pw_9", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_9", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 512, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "name": "conv_pw_9_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_9_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "name": "conv_pw_9_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_9_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "name": "conv_dw_10", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "name": "conv_dw_10", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "name": "conv_dw_10_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_10_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "name": "conv_dw_10_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_10_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "name": "conv_pw_10", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_10", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 512, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "name": "conv_pw_10_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_10_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "name": "conv_pw_10_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_10_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "name": "conv_dw_11", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "name": "conv_dw_11", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "name": "conv_dw_11_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_11_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "name": "conv_dw_11_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_11_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "name": "conv_pw_11", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_11", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 512, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "name": "conv_pw_11_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_11_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "name": "conv_pw_11_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_11_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "name": "conv_pad_12", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "conv_pad_12", "padding": [[0, 1], [0, 1]]}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "name": "conv_dw_12", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [2, 2], "name": "conv_dw_12", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "valid", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "name": "conv_dw_12_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_12_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "name": "conv_dw_12_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_12_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "name": "conv_pw_12", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_12", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 1024, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "name": "conv_pw_12_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_12_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "name": "conv_pw_12_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_12_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "name": "conv_dw_13", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "name": "conv_dw_13", "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "depth_multiplier": 1, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "depthwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "name": "conv_dw_13_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_13_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "name": "conv_dw_13_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_dw_13_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "name": "conv_pw_13", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv_pw_13", "kernel_size": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 1024, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "name": "conv_pw_13_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_13_bn", "dtype": "float32", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "scale": true}}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "name": "conv_pw_13_relu", "config": {"negative_slope": 0.0, "threshold": 0.0, "name": "conv_pw_13_relu", "max_value": 6.0, "dtype": "float32", "trainable": true}}, {"class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "name": "global_pooling", "config": {"dtype": "float32", "trainable": true, "name": "global_pooling", "data_format": "channels_last"}}, {"class_name": "Dropout", "inbound_nodes": [[["global_pooling", 0, 0, {}]]], "name": "dropout_1", "config": {"dtype": "float32", "name": "dropout_1", "rate": 0.5, "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "feats", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "feats", "dtype": "float32", "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "units": 256, "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["feats", 0, 0, {}]]], "name": "emotion_preds", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "emotion_preds", "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "units": 7, "trainable": true}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "conv1_2/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv1_bn_2/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn_2/beta", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn_2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn_2/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_2/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "conv_dw_10_2/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_10_bn_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn_2/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_2/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_11_bn_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn_2/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_2/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_12_bn_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn_2/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_13_2/depthwise_kernel", "shape": [3, 3, 1024, 1], "dtype": "float32"}, {"name": "conv_dw_13_bn_2/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn_2/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn_2/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn_2/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_1_bn_2/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn_2/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn_2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn_2/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_2_2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv_dw_2_bn_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn_2/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_3_2/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_3_bn_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn_2/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_2/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_4_bn_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn_2/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_5_2/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_5_bn_2/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn_2/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn_2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn_2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_2/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_6_bn_2/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn_2/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn_2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn_2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_7_2/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_7_bn_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn_2/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_2/depthwise_kernel", "shape": [3, 